Western Civilization/11 Mass burial and cremation of plague victims.org
#+OPTIONS: \n:t toc:nil num:nil html-postamble:nil
#+HTML_HEAD_EXTRA: <style>body {background: rgb(193, 230, 198) !important;}</style>
* 11 Mass burial and cremation of plague victims
#+begin_verse
As a result of their conquests in the thirteenth and fourteenth centuries,
	the Mongols assembled a vast empire stretching from Russia in the west to China in the east.
Mongol rule brought stability to the Eurasian trade routes;
	increased trade brought prosperity but also avenues for the spread of flea-infested rats
		that carried bubonic plague to both East Asia and Europe.
In the mid-fourteenth century,
	one of the most destructive natural disasters in history erupted---the Black Death.
One contemporary observer named Henry Knighton,
		a canon of Saint Mary-of-the-Meadow Abbey in Leicester, England,
	was simply overwhelmed by the magnitude of the catastrophe.
Knighton began his account of the great plague with these words:
	In this year [1348] and in the following one
		there was a general mortality of people throughout the whole world.
Few were left untouched;
	the plague struck even isolated monasteries:
		At Montpellier, there remained out of a hundred and forty friars only seven.
Knighton was also stunned by the economic and social consequences of the Black Death.
Prices dropped: And the price of everything was cheap, because of the fear of death;
	there were very few who took any care for their wealth, or for anything else.
Meanwhile, laborers were scarce, so their wages increased:
	In the following autumn,
		one could not hire a reaper at a lower wage than eight pence with food,
			or a mower at less than twelve pence with food.
Because of this, much grain rotted in the fields for lack of harvesting.
So many people died that some towns were deserted and some villages disappeared altogether:
	Many small villages and hamlets were completely deserted;
		there was not one house left in them, but all those who had lived in them were dead.
Some people thought the end of the world was at hand.

Plague was not the only disaster in the fourteenth century, however.
Signs of disintegration were everywhere:
	famine, economic depression, war, social upheaval, a rise in crime and violence,
	and a decline in the power of the universal Catholic church.
Periods of disintegration, however, are often fertile grounds for change and new developments.
Out of the dissolution of medieval civilization came a rebirth of culture
	that has come to be known as the Renaissance.
#+end_verse
** expression
vast [væst]: adj. extremely large SYN huge巨大的, 辽阔的
stable [ˈsteɪb(ə)l] stability: adj. n. steady and not likely to move or change OPP unstable ⇨ stability稳定的
route [rut]: n. a way between two places that buses, planes, ships etc regularly travel路线
avenue [ˈævəˌnu]: n. a possible way of achieving something方法, 途径
infested [ɪnˈfest]: adj. if insects, rats etc infest a place, there are a lot of them and they usually cause damage大批滋生的
plague [pleɪɡ]: n. v. a disease that causes death and spreads quickly to a large number of people瘟疫,折磨
contemporary [kənˈtɛmpəˌrɛri]: adj. belonging to the present time SYN modern当代的, 同时代的
untouched [ˌʌnˈtʌtʃt]: adj. not changed, damaged, or affected in any way未触及的, 未改变的
isolated [ˈaɪsəˌleɪtəd]: adj. an isolated building, village etc is far away from any others SYN remote隔离的,孤立的
scarce [skers]: adj. if something is scarce, there is not very much of it available缺乏的, 不足的
reaper [ˈripər]: n. 收割的人
mower [ˈmoʊr]: n. 割草的人
rot [rɑt]: v. to decay by a gradual natural process, or to make something do this(使)腐烂, (使)腐败
disintegrate [dɪsˈɪntɪˌɡreɪt] disintegration: v. n. to break up, or make something break up, into very small pieces(使)分解, (使)碎裂
famine [ˈfæmɪn]: n. a situation in which a large number of people have little or no food for a long time and many people die饥荒
universal [ˌjunɪˈvɜrs(ə)l]: adj. involving everyone in the world or in a particular group普遍的, 全体的
dissolution [ˌdɪsəˈluʃ(ə)n]: n. the process by which something gradually becomes weaker and disappears分解, 解散
--------------------
stretch from A to B: 从A延伸到B
be overwhelmed by sth.: 被某事淹没
the magnitude of sth.: 某事的巨大
be stunned by sth.: 被某事震惊
began sb's account of sth. with these words: 用这些话开始某人对某事的叙述
economic depression: 经济萧条
social upheaval: 社会动荡
be fertile grounds for sth.: 称为某物的沃土
