Western Civilization/11 Mass burial and cremation of plague victims.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-09 Thu 23:35 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="DESKTOP-13B7HQM" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-org4193917" class="outline-2">
<h2 id="org4193917">11 Mass burial and cremation of plague victims</h2>
<div class="outline-text-2" id="text-org4193917">
<p class="verse">
As a result of their conquests in the thirteenth and fourteenth centuries,<br />
&#xa0;the Mongols assembled a vast empire stretching from Russia in the west to China in the east.<br />
Mongol rule brought stability to the Eurasian trade routes;<br />
&#xa0;increased trade brought prosperity but also avenues for the spread of flea-infested rats<br />
&#xa0;&#xa0;that carried bubonic plague to both East Asia and Europe.<br />
In the mid-fourteenth century,<br />
&#xa0;one of the most destructive natural disasters in history erupted&#x2014;the Black Death.<br />
One contemporary observer named Henry Knighton,<br />
&#xa0;&#xa0;a canon of Saint Mary-of-the-Meadow Abbey in Leicester, England,<br />
&#xa0;was simply overwhelmed by the magnitude of the catastrophe.<br />
Knighton began his account of the great plague with these words:<br />
&#xa0;In this year [1348] and in the following one<br />
&#xa0;&#xa0;there was a general mortality of people throughout the whole world.<br />
Few were left untouched;<br />
&#xa0;the plague struck even isolated monasteries:<br />
&#xa0;&#xa0;At Montpellier, there remained out of a hundred and forty friars only seven.<br />
Knighton was also stunned by the economic and social consequences of the Black Death.<br />
Prices dropped: And the price of everything was cheap, because of the fear of death;<br />
&#xa0;there were very few who took any care for their wealth, or for anything else.<br />
Meanwhile, laborers were scarce, so their wages increased:<br />
&#xa0;In the following autumn,<br />
&#xa0;&#xa0;one could not hire a reaper at a lower wage than eight pence with food,<br />
&#xa0;&#xa0;&#xa0;or a mower at less than twelve pence with food.<br />
Because of this, much grain rotted in the fields for lack of harvesting.<br />
So many people died that some towns were deserted and some villages disappeared altogether:<br />
&#xa0;Many small villages and hamlets were completely deserted;<br />
&#xa0;&#xa0;there was not one house left in them, but all those who had lived in them were dead.<br />
Some people thought the end of the world was at hand.<br />
<br />
Plague was not the only disaster in the fourteenth century, however.<br />
Signs of disintegration were everywhere:<br />
&#xa0;famine, economic depression, war, social upheaval, a rise in crime and violence,<br />
&#xa0;and a decline in the power of the universal Catholic church.<br />
Periods of disintegration, however, are often fertile grounds for change and new developments.<br />
Out of the dissolution of medieval civilization came a rebirth of culture<br />
&#xa0;that has come to be known as the Renaissance.<br />
</p>
</div>
<div id="outline-container-org6bc95f5" class="outline-3">
<h3 id="org6bc95f5">expression</h3>
<div class="outline-text-3" id="text-org6bc95f5">
<p>
vast [væst]: adj. extremely large SYN huge巨大的, 辽阔的<br />
stable [ˈsteɪb(ə)l] stability: adj. n. steady and not likely to move or change OPP unstable ⇨ stability稳定的<br />
route [rut]: n. a way between two places that buses, planes, ships etc regularly travel路线<br />
avenue [ˈævəˌnu]: n. a possible way of achieving something方法, 途径<br />
infested [ɪnˈfest]: adj. if insects, rats etc infest a place, there are a lot of them and they usually cause damage大批滋生的<br />
plague [pleɪɡ]: n. v. a disease that causes death and spreads quickly to a large number of people瘟疫,折磨<br />
contemporary [kənˈtɛmpəˌrɛri]: adj. belonging to the present time SYN modern当代的, 同时代的<br />
untouched [ˌʌnˈtʌtʃt]: adj. not changed, damaged, or affected in any way未触及的, 未改变的<br />
isolated [ˈaɪsəˌleɪtəd]: adj. an isolated building, village etc is far away from any others SYN remote隔离的,孤立的<br />
scarce [skers]: adj. if something is scarce, there is not very much of it available缺乏的, 不足的<br />
reaper [ˈripər]: n. 收割的人<br />
mower [ˈmoʊr]: n. 割草的人<br />
rot [rɑt]: v. to decay by a gradual natural process, or to make something do this(使)腐烂, (使)腐败<br />
disintegrate [dɪsˈɪntɪˌɡreɪt] disintegration: v. n. to break up, or make something break up, into very small pieces(使)分解, (使)碎裂<br />
famine [ˈfæmɪn]: n. a situation in which a large number of people have little or no food for a long time and many people die饥荒<br />
universal [ˌjunɪˈvɜrs(ə)l]: adj. involving everyone in the world or in a particular group普遍的, 全体的<br />
dissolution [ˌdɪsəˈluʃ(ə)n]: n. the process by which something gradually becomes weaker and disappears分解, 解散<br />
</p>
<hr />
<p>
stretch from A to B: 从A延伸到B<br />
be overwhelmed by sth.: 被某事淹没<br />
the magnitude of sth.: 某事的巨大<br />
be stunned by sth.: 被某事震惊<br />
began sb's account of sth. with these words: 用这些话开始某人对某事的叙述<br />
economic depression: 经济萧条<br />
social upheaval: 社会动荡<br />
be fertile grounds for sth.: 称为某物的沃土<br />
</p>
</div>
</div>
