Western Civilization/11 Mass burial and cremation of plague victims.org
** sentence
vast: adj. extremely large SYN huge巨大的, 辽阔的
- The east empire was said to possess a vast territory. 
- It is disturbing to think in the challenge of a vast empire.
- The vast empire was sacked by its neighbors, these Asiatic nomads.
stable stability: adj. n. steady and not likely to move or change OPP unstable ⇨ stability稳定的
- The rise in social status has brought stability to his family.
- The crusading knights brought stability to the Medieval world.
- I confirmed that turning to the pope would bring stability to our country and people. 
route: n. a way between two places that buses, planes, ships etc regularly travel路线
- I did not know the route to my hotel so I had to ask for helps.
- If you knew the route to our hotel, we wouldn't have had to ask for a lift.
- Not knowing the route to our hotel, we had lost in the forest and missed our reception.
avenue: n. a possible way of achieving something方法, 途径
- These sumggars may be the avenue for the spread of flea-infested rats.
- These visitors must be the avenue for the spread of strange pleagues. 
- Repeating 50 times is the avenue for the memory of this story.
infested: adj. if insects, rats etc infest a place, there are a lot of them and they usually cause damage大批滋生的
- My wife is alway complaining about infested mold found in our refrigeer.
- There are infested rats underneath the carpet.
- In fourteenth century, people suffering from Black Death got acclimated to infested rats in their houses.
plague: n. v. a disease that causes death and spreads quickly to a large number of people瘟疫,折磨
- Bad breath plagued him so much that he lost attraction to his girlfriend.
- The vicar spotted a plague erupting in the remote village.
- The village happened to erupt plague when a group of doctors were visiting it.
contemporary: adj. belonging to the present time SYN modern当代的, 同时代的
- It is disturbing to think that we don't have access to contemporary English in this country.
- He obviously could not tell the difference between contemporary music and jazz.
- The rapper responded with contemporary music to the brutal executions.
untouched: adj. not changed, damaged, or affected in any way未触及的, 未改变的
- Dissent from his family, he remains untouched.
- The crusading army sacked this city where only the monument remained untouched.
- Few remained untouched and other cities in the empire had bee conquered by Mongols.
isolated: adj. an isolated building, village etc is far away from any others SYN remote隔离的,孤立的
- He has been losting in an isolated island and missed his marriage with Lily.
- Pirates were said to bury treasure in isolated islands in the South pacific.
- The student is so isolated that he has to perform experiment by himself.
scarce: adj. if something is scarce, there is not very much of it available缺乏的, 不足的
- The labors in this farm is so scare that the boss instructed me to do manual works.
- In spite of scarce manual labors, the workers in the mine still get a lower wage.
- The food is so scarce that many children starve to death in a drought.
reaper: n. 收割的人
- 
- 
- 
mower: n. 割草的人
- 
- 
- 
rot: v. to decay by a gradual natural process, or to make something do this(使)腐烂, (使)腐败
- My neighbor blamed me for feeding his pig rotted apples.
- In my childhood, my grandmother often fed me rotted fruits like, apples, pineapples, and tomatoes.
- The moment the fruits are rotted, I will be allowed to have them.
disintegrate disintegration: v. n. to break up, or make something break up, into very small pieces(使)分解, (使)碎裂
- The disintegration of the republic gave rise to a trail of small countries in Europe.
- No one could account for the fact that the empire was disintegrated after its capital had been sacked.
- The president aimed for the disintegration of his enemy, a republic country in Asia.
famine: n. a situation in which a large number of people have little or no food for a long time and many people die饥荒
- Our people must have been exercised in the challenge of the famine.
- There was a serious famine in China which caused hundreds of millions of people starve to death.
- Because of lengthy famine, people in this country universally live in poverty.
universal universally: adj. involving everyone in the world or in a particular group普遍的, 全体的
- People suffering from famines are universally susceptible to be infected small pox.
- The exalted claim of papal power is increasingly challenged by the universal rise of the monarchical authorities. 
- These days our subsidiaries make universal progresses.
dissolution: n. the process by which something gradually becomes weaker and disappears分解, 解散
- The dissolution of his enterprise led to his loss of marriage.
- The dissolution of a great empire is often a fertile ground for many dynamic companies.
- At last, the dissolution of the scientists' team shocked our president.
--------------------
stretch from A to B: 从A延伸到B
- A large land strethcing from our town to next village is in the possession of the lord.
- Imagine my surprise when I was told that a field stretching from my foot to my father's belongs to our family.
- I am going to cross the plain stretching from China to Russia.
be overwhelmed by sth.: 被某事淹没
- Overwhelmed by mass coverages from the chaos, he was not able to figure out whether his wife was still alive.
- Overwhelmed by facts and statistics, the journalist developed a headache.
- I am susceptible to be overwhelmed by emotions.
the magnitude of sth.: 某事的巨大
- The maginitude of the monument inspired own in tens of thousands of tourists.
- The priest was shocked by the magnitude of refugees.
- The magnitude of the Children Crusade shocked the pope in Italy.
be stunned by sth.: 被某事震惊
- My father is stunned by me, who crept into his room to steal his money.
- I am stunned by my colleague who cheated on her husband.
- She must be stunned by the magnitude of the death people in the drought.
began sb's account of sth. with these words: 用这些话开始某人对某事的叙述
- She likes to begin her account of her story with these words at the reception.
- Everyone admires him for his great sense of humor and remembers that he always begins his account of his stories with these words.
- He changed his mind and began his account of the events with these words.
economic depression: 经济萧条
- Because of economic depression, our company didn't make a profit last year.
- Because of economic depression, prices universally dropped.
- Because of economic depression, we didn't get enough money to go on a vacation in Sanya.
social upheaval: 社会动荡
- In spite of social upheaval, the machinery of the government enabled the monarchs to assume political power.
- Our people are susceptible to be attcked by social upheaval.
- The Asiatic nomads pushed their way westward, which led to serious social upheaval in eastern Europe.
be fertile grounds for sth.: 称为某物的沃土
- The disintegration of the great empire has been fertile grounds for many kingdoms.
- The rise of cities, trade, and a money economy proved to be a fertile ground for the monarchical power.
- The plain must be a fertile grounds for infested rats.
