Western Civilization/11 Mass burial and cremation of plague victims.html
<div id="outline-container-org8e85d08" class="outline-3">
<h3 id="org8e85d08">sentence2</h3>
<div class="outline-text-3" id="text-org8e85d08">
<p>
vast: adj. extremely large SYN huge巨大的, 辽阔的<br />
</p>
<ul class="org-ul">
<li>The east empire was said to possess a vast territory.<br /></li>
<li>It is disturbing to think of the challenge of a vast empire.<br /></li>
<li>The vast empire was sacked by its neighbors, these Asiatic nomads.<br /></li>
</ul>
<p>
stable stability: adj. n. steady and not likely to move or change OPP unstable ⇨ stability稳定的<br />
</p>
<ul class="org-ul">
<li>The rise in social status has brought stability to his family.<br /></li>
<li>The crusading knights brought stability to the Medieval world.<br /></li>
<li>I confirmed that turning to the pope would bring stability to our country and people.<br /></li>
</ul>
<p>
route: n. a way between two places that buses, planes, ships etc regularly travel路线<br />
</p>
<ul class="org-ul">
<li>I did not know the route to my hotel so I had to ask for help.<br /></li>
<li>If you knew the route to our hotel, we wouldn't have had to ask for a lift.<br /></li>
<li>Not knowing the route to our hotel, we lost our way in the forest and missed our reception.<br /></li>
</ul>
<p>
avenue: n. a possible way of achieving something方法, 途径<br />
</p>
<ul class="org-ul">
<li>These smugglers may be the avenue for the spread of flea-infested rats.<br /></li>
<li>These visitors must be the avenue for the spread of strange plagues.<br /></li>
<li>Repeating 50 times is the avenue for the memory of this story.<br /></li>
</ul>
<p>
infested: adj. if insects, rats etc infest a place, there are a lot of them and they usually cause damage大批滋生的<br />
</p>
<ul class="org-ul">
<li>My wife is always complaining about infested mold found in our refrigerator.<br /></li>
<li>There are infested rats underneath the carpet.<br /></li>
<li>In the fourteenth century, people suffering from the Black Death got acclimated to infested rats in their houses.<br /></li>
</ul>
<p>
plague: n. v. a disease that causes death and spreads quickly to a large number of people瘟疫,折磨<br />
</p>
<ul class="org-ul">
<li>Bad breath plagued him so much that he lost attraction to his girlfriend.<br /></li>
<li>The vicar spotted a plague erupting in the remote village.<br /></li>
<li>The village happened to erupt a plague when a group of doctors were visiting it.<br /></li>
</ul>
<p>
contemporary: adj. belonging to the present time SYN modern当代的, 同时代的<br />
</p>
<ul class="org-ul">
<li>It is disturbing to think that we don't have access to contemporary English in this country.<br /></li>
<li>He obviously could not tell the difference between contemporary music and jazz.<br /></li>
<li>The rapper responded with contemporary music to the brutal executions.<br /></li>
</ul>
<p>
untouched: adj. not changed, damaged, or affected in any way未触及的, 未改变的<br />
</p>
<ul class="org-ul">
<li>Dissent from his family, he remains untouched.<br /></li>
<li>The crusading army sacked this city where only the monument remained untouched.<br /></li>
<li>Few remained untouched and other cities in the empire had been conquered by Mongols.<br /></li>
</ul>
<p>
isolated: adj. an isolated building, village etc is far away from any others SYN remote隔离的,孤立的<br />
</p>
<ul class="org-ul">
<li>He has been lost on an isolated island and missed his marriage with Lily.<br /></li>
<li>Pirates were said to bury treasure in isolated islands in the South Pacific.<br /></li>
<li>The student is so isolated that he has to perform experiments by himself.<br /></li>
</ul>
<p>
scarce: adj. if something is scarce, there is not very much of it available缺乏的, 不足的<br />
</p>
<ul class="org-ul">
<li>The laborers on this farm are so scarce that the boss instructed me to do manual work.<br /></li>
<li>In spite of scarce manual laborers, the workers in the mine still get a lower wage.<br /></li>
<li>The food is so scarce that many children starve to death in a drought.<br /></li>
</ul>
<p>
reaper: n. 收割的人<br />
</p>
<ul class="org-ul">
<li></li>

<li></li>

<li></li>
</ul>
<p>
mower: n. 割草的人<br />
</p>
<ul class="org-ul">
<li></li>

<li></li>

<li></li>
</ul>
<p>
rot: v. to decay by a gradual natural process, or to make something do this(使)腐烂, (使)腐败<br />
</p>
<ul class="org-ul">
<li>My neighbor blamed me for feeding his pig rotted apples.<br /></li>
<li>In my childhood, my grandmother often fed me rotted fruits like apples, pineapples, and tomatoes.<br /></li>
<li>The moment the fruits are rotted, I will be allowed to have them.<br /></li>
</ul>
<p>
disintegrate disintegration: v. n. to break up, or make something break up, into very small pieces(使)分解, (使)碎裂<br />
</p>
<ul class="org-ul">
<li>The disintegration of the republic gave rise to a trail of small countries in Europe.<br /></li>
<li>No one could account for the fact that the empire was disintegrated after its capital had been sacked.<br /></li>
<li>The president aimed for the disintegration of his enemy, a republic country in Asia.<br /></li>
</ul>
<p>
famine: n. a situation in which a large number of people have little or no food for a long time and many people die饥荒<br />
</p>
<ul class="org-ul">
<li>Our people must have been exercised in the challenge of the famine.<br /></li>
<li>There was a serious famine in China which caused hundreds of millions of people to starve to death.<br /></li>
<li>Because of lengthy famine, people in this country universally live in poverty.<br /></li>
</ul>
<p>
universal universally: adj. involving everyone in the world or in a particular group普遍的, 全体的<br />
</p>
<ul class="org-ul">
<li>People suffering from famines are universally susceptible to being infected with smallpox.<br /></li>
<li>The exalted claim of papal power is increasingly challenged by the universal rise of the monarchical authorities.<br /></li>
<li>These days our subsidiaries make universal progress.<br /></li>
</ul>
<p>
dissolution: n. the process by which something gradually becomes weaker and disappears分解, 解散<br />
</p>
<ul class="org-ul">
<li>The dissolution of his enterprise led to his loss of marriage.<br /></li>
<li>The dissolution of a great empire is often a fertile ground for many dynamic companies.<br /></li>
<li>At last, the dissolution of the scientists' team shocked our president.<br /></li>
</ul>
<hr />
<p>
stretch from A to B: 从A延伸到B<br />
</p>
<ul class="org-ul">
<li>A large land stretching from our town to the next village is in the possession of the lord.<br /></li>
<li>Imagine my surprise when I was told that a field stretching from my foot to my father's belongs to our family.<br /></li>
<li>I am going to cross the plain stretching from China to Russia.<br /></li>
</ul>
<p>
be overwhelmed by sth.: 被某事淹没<br />
</p>
<ul class="org-ul">
<li>Overwhelmed by mass coverage from the chaos, he was not able to figure out whether his wife was still alive.<br /></li>
<li>Overwhelmed by facts and statistics, the journalist developed a headache.<br /></li>
<li>I am susceptible to being overwhelmed by emotions.<br /></li>
</ul>
<p>
the magnitude of sth.: 某事的巨大<br />
</p>
<ul class="org-ul">
<li>The magnitude of the monument inspired own in tens of thousands of tourists.<br /></li>
<li>The priest was shocked by the magnitude of refugees.<br /></li>
<li>The magnitude of the Children's Crusade shocked the pope in Italy.<br /></li>
</ul>
<p>
be stunned by sth.: 被某事震惊<br />
</p>
<ul class="org-ul">
<li>My father is stunned by me, who crept into his room to steal his money.<br /></li>
<li>I am stunned by my colleague who cheated on her husband.<br /></li>
<li>She must be stunned by the magnitude of the deaths in the drought.<br /></li>
</ul>
<p>
began sb's account of sth. with these words: 用这些话开始某人对某事的叙述<br />
</p>
<ul class="org-ul">
<li>She likes to begin her account of her story with these words at the reception.<br /></li>
<li>Everyone admires him for his great sense of humor and remembers that he always begins his account of his stories with these words.<br /></li>
<li>He changed his mind and began his account of the events with these words.<br /></li>
</ul>
<p>
economic depression: 经济萧条<br />
</p>
<ul class="org-ul">
<li>Because of economic depression, our company didn't make a profit last year.<br /></li>
<li>Because of economic depression, prices universally dropped.<br /></li>
<li>Because of economic depression, we didn't get enough money to go on a vacation in Sanya.<br /></li>
</ul>
<p>
social upheaval: 社会动荡<br />
</p>
<ul class="org-ul">
<li>In spite of social upheaval, the machinery of the government enabled the monarchs to assume political power.<br /></li>
<li>Our people are susceptible to being attacked by social upheaval.<br /></li>
<li>The Asiatic nomads pushed their way westward, which led to serious social upheaval in Eastern Europe.<br /></li>
</ul>
<p>
be fertile grounds for sth.: 称为某物的沃土<br />
</p>
<ul class="org-ul">
<li>The disintegration of the great empire has been a fertile ground for many kingdoms.<br /></li>
<li>The rise of cities, trade, and a money economy proved to be a fertile ground for the monarchical power.<br /></li>
<li>The plain must be a fertile ground for infested rats.<br /></li>
</ul>
</div>
</div>
