Western Civilization/11 Mass burial and cremation of plague victims.org
** summary
Mogols rule brought prosperity but also flea-infested rats that carried bubonic pleagues.
According to a contemporary observer's words,
	there was a general mortality of people throughout the world over.
Few remained untouched, the plagues even attacked isolated monasteries.
People who had lived in some villages and hamlets were all dead.
Prices dropped, for no one took care of their wealth.
Because of scarce laborors, the laborors became so expensive that grain was rotted in the fields.
Some people thought the end of the world was at hand.
Signs of disintegration were everywhere:
	famine, economic depression, war, social upheaval, a rise in crime and violence,
	and a decline in the power of the univerisal Catholic church.
However, out of disolutions of the Medieval Civilization came a rebirth of culture
	known as the Renaissance.
** summary2
Mogols' rule brought prosperity but also flea-infested rats that carried bubonic plagues.
According to a contemporary observer's words,
	there was a general mortality of people throughout the whole world.
Few remained untouched, the plague even attacked isolated monasteries.
People who had lived in some villages and hamlets were all dead.
Prices dropped, for no one took care of their wealth.
Because of scarce laborers, the laborers became so expensive that grain was rotted in the fields.
Some people thought the end of the world was at hand.
Signs of disintegration were everywhere:
	famine, economic depression, war, social upheaval, a rise in crime and violence,
	and a decline in the power of the universal Catholic church.
However, out of the dissolution of the Medieval Civilization came a rebirth of culture
	known as the Renaissance.

