Western Civilization/11 Mass burial and cremation of plague victims.html
<div id="outline-container-org4dd6900" class="outline-3">
<h3 id="org4dd6900">summary</h3>
<div class="outline-text-3" id="text-org4dd6900">
<p>
Mogols rule brought prosperity but also flea-infested rats that carried bubonic pleagues.<br />
According to a contemporary observer's words,<br />
	there was a general mortality of people throughout the world over.<br />
Few remained untouched, the plagues even attacked isolated monasteries.<br />
People who had lived in some villages and hamlets were all dead.<br />
Prices dropped, for no one took care of their wealth.<br />
Because of scarce laborors, the laborors became so expensive that grain was rotted in the fields.<br />
Some people thought the end of the world was at hand.<br />
Signs of disintegration were everywhere:<br />
	famine, economic depression, war, social upheaval, a rise in crime and violence,<br />
	and a decline in the power of the univerisal Catholic church.<br />
However, out of disolutions of the Medieval Civilization came a rebirth of culture<br />
	known as the Renaissance.<br />
</p>
</div>
</div>
<div id="outline-container-orgb1af879" class="outline-3">
<h3 id="orgb1af879">summary2</h3>
<div class="outline-text-3" id="text-orgb1af879">
<p>
Mogols' rule brought prosperity but also flea-infested rats that carried bubonic plagues.<br />
According to a contemporary observer's words,<br />
	there was a general mortality of people throughout the whole world.<br />
Few remained untouched, the plague even attacked isolated monasteries.<br />
People who had lived in some villages and hamlets were all dead.<br />
Prices dropped, for no one took care of their wealth.<br />
Because of scarce laborers, the laborers became so expensive that grain was rotted in the fields.<br />
Some people thought the end of the world was at hand.<br />
Signs of disintegration were everywhere:<br />
	famine, economic depression, war, social upheaval, a rise in crime and violence,<br />
	and a decline in the power of the universal Catholic church.<br />
However, out of the dissolution of the Medieval Civilization came a rebirth of culture<br />
	known as the Renaissance.<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
